Конфигурация/src/Documents/Занятие/Занятие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Занятие</name>
  <registerRecords>AccumulationRegister.УчебнаяНагрузкаПреподавателей</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебныйПериод</name>
    <type>
      <types>CatalogRef.УчебныеПериоды</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗанятия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗанятия</name>
    <type>
      <types>CatalogRef.ВидыЗанятий</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Преподаватели</types>
    </type>
  </attributes>
  <attributes>
    <name>Аудитория</name>
    <type>
      <types>CatalogRef.Аудитории</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состоялось</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

Конфигурация/src/AccumulationRegisters/УчебнаяНагрузкаПреподавателей/УчебнаяНагрузкаПреподавателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УчебнаяНагрузкаПреподавателей</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>УчебныйПериод</name>
    <type>
      <types>CatalogRef.УчебныеПериоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Аудитория</name>
    <type>
      <types>CatalogRef.Аудитории</types>
    </type>
  </attributes>
  <dimensions>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Преподаватели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗанятия</name>
    <type>
      <types>CatalogRef.ВидыЗанятий</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Конфигурация/src/Documents/Занятие/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если НЕ Состоялось Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Преподаватель) Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Дисциплина) Тогда
		Возврат;
	КонецЕсли;

	Если КоличествоЧасов <= 0 Тогда
		Возврат;
	КонецЕсли;

	Движения.УчебнаяНагрузкаПреподавателей.Записывать = Истина;

	Движение = Движения.УчебнаяНагрузкаПреподавателей.Добавить();
	Движение.Период = ДатаЗанятия;
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Преподаватель = Преподаватель;
	Движение.Дисциплина = Дисциплина;
	Движение.УчебнаяГруппа = УчебнаяГруппа;
	Движение.ВидЗанятия = ВидЗанятия;
	Движение.КоличествоЧасов = КоличествоЧасов;
	Движение.УчебныйПериод = УчебныйПериод;
	Движение.Аудитория = Аудитория;

КонецПроцедуры
